DROP TABLE students;

CREATE TABLE IF NOT EXISTS students (
                          id INT AUTO_INCREMENT PRIMARY KEY,
                          first_name VARCHAR(50) NOT NULL,
                          last_name VARCHAR(50) NOT NULL,
                          middle_name VARCHAR(50),
                          birth_date DATE NOT NULL,
                          record_book_number VARCHAR(20) UNIQUE NOT NULL
);
INSERT INTO students (first_name, last_name, middle_name, birth_date, record_book_number) VALUES
                                                                                               ('Іван', 'Петров', 'Олександрович', '2000-01-15', 'S001'),
                                                                                               ('Марія', 'Іванова', 'Сергіївна', '2001-02-20', 'S002'),
                                                                                               ('Олег', 'Сидоренко', 'Миколайович', '1999-03-10', 'S003'),
                                                                                               ('Наталія', 'Коваль', 'Ігорівна', '2002-04-05', 'S004'),
                                                                                               ('Василь', 'Гончар', 'Васильович', '2000-05-12', 'S005'),
                                                                                               ('Андрій', 'Мельник', 'Андрійович', '1998-07-25', 'S006'),
                                                                                               ('Світлана', 'Ткаченко', 'Володимирівна', '2001-08-14', 'S007'),
                                                                                               ('Юрій', 'Бондар', 'Юрійович', '1997-09-30', 'S008'),
                                                                                               ('Олександр', 'Шевченко', 'Олександрович', '1996-10-07', 'S009'),
                                                                                               ('Ганна', 'Захарова', 'Григорівна', '2003-11-18', 'S010'),
                                                                                               ('Дмитро', 'Лисенко', 'Павлович', '1999-12-23', 'S011'),
                                                                                               ('Олена', 'Романенко', 'Віталіївна', '2002-01-08', 'S012'),
                                                                                               ('Максим', 'Кравченко', 'Богданович', '1995-02-14', 'S013'),
                                                                                               ('Катерина', 'Данилюк', 'Семенівна', '1998-03-19', 'S014'),
                                                                                               ('Ігор', 'Федорчук', 'Олександрович', '2000-04-22', 'S015'),
                                                                                               ('Оксана', 'Семенова', 'Анатоліївна', '2001-05-28', 'S016'),
                                                                                               ('Богдан', 'Кузьменко', 'Ігорович', '1997-07-09', 'S017'),
                                                                                               ('Людмила', 'Павленко', 'Олегівна', '1999-08-16', 'S018'),
                                                                                               ('Роман', 'Дорошенко', 'Євгенович', '1996-09-27', 'S019'),
                                                                                               ('Тетяна', 'Мартиненко', 'Іванівна', '2003-10-11', 'S020');
